# MongoDB 操作符

## 条件操作符

MongoDB中的条件操作符 :

+ `$gt` : 大于(>)
+ `$lt` : 小于(<)
+ `$gte` : 大于等于(>=)
+ `$lte` : 小于等于(<=)

### 准备数据

仍然使用该数据库下的 `players` 集合，将集合中的数据全部删除 :

```shell
> db.players.remove({})
WriteResult({ "nRemoved" : 2 })
> db.players.find()
>
```

然后插入以下数据 :

```shell
db.players.insert({name: 'James', age: 30, team: 'cav', points: 25000 })
db.players.insert({name: 'Curry', age: 27, team: 'saw', points: 15000 })
db.players.insert({name: 'Wade', age: 33, team: 'mia', points: 20000 })
db.players.insert({name: 'Bosh', age: 31, team: 'mia', points: 17000 })
db.players.insert({name: 'Kobe', age: 37, team: 'lal', points: 35000 })
```

查询 :

```shell
> db.players.find()                                                                                             
{ "_id" : ObjectId("570f4ae4834e0c95484e80ac"), "name" : "James", "age" : 30, "team" : "cav", "points" : 25000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ad"), "name" : "Curry", "age" : 27, "team" : "saw", "points" : 15000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ae"), "name" : "Wade", "age" : 33, "team" : "mia", "points" : 20000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80af"), "name" : "Bosh", "age" : 31, "team" : "mia", "points" : 17000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80b0"), "name" : "Kobe", "age" : 37, "team" : "lal", "points" : 35000 }
```

### MongoDB (>) 大于操作符 - `$gt`

查询`players`中年龄大于30的球员 :

```shell
> db.players.find({"age": {$gt: 30}})                                                                          
{ "_id" : ObjectId("570f4ae4834e0c95484e80ae"), "name" : "Wade", "age" : 33, "team" : "mia", "points" : 20000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80af"), "name" : "Bosh", "age" : 31, "team" : "mia", "points" : 17000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80b0"), "name" : "Kobe", "age" : 37, "team" : "lal", "points" : 35000 }
```

类似于SQL :

```sql
select * from players where age > 30
```

### MongoDB（>=）大于等于操作符 - `$gte`

查询`players`中年龄大于等于30的球员 :

```shell
> db.players.find({"age": {$gte: 30}})
{ "_id" : ObjectId("570f4ae4834e0c95484e80ac"), "name" : "James", "age" : 30, "team" : "cav", "points" : 25000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ae"), "name" : "Wade", "age" : 33, "team" : "mia", "points" : 20000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80af"), "name" : "Bosh", "age" : 31, "team" : "mia", "points" : 17000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80b0"), "name" : "Kobe", "age" : 37, "team" : "lal", "points" : 35000 }
>
```

类似于SQL :

```sql
select * from players where age >= 30
```

### MongoDB (<) 小于操作符 - `$lt`

查询`players`中年龄小于30的球员 :

```shell
> db.players.find({"age": {$lt: 30}})
{ "_id" : ObjectId("570f4ae4834e0c95484e80ad"), "name" : "Curry", "age" : 27, "team" : "saw", "points" : 15000 }
```

类似于SQL :

```sql
select * from players where age < 30
```

### MongoDB (<=) 小于操作符 - `$lte`

查询`players`中年龄小于等于30的球员 :

```shell
> db.players.find({"age": {$lte: 30}})                                                                          
{ "_id" : ObjectId("570f4ae4834e0c95484e80ac"), "name" : "James", "age" : 30, "team" : "cav", "points" : 25000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ad"), "name" : "Curry", "age" : 27, "team" : "saw", "points" : 15000 }
>                                                                                                               
```

类似于SQL :

```sql
select * from players where age <= 30
```

### MongoDB 使用 (<) 和 (>) 查询 - `$lt` 和 `$gt`

查询`players`中年龄大于30小于35的球员 :

```shell
> db.players.find({"age": {$gt: 30, $lt: 35}})
{ "_id" : ObjectId("570f4ae4834e0c95484e80ae"), "name" : "Wade", "age" : 33, "team" : "mia", "points" : 20000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80af"), "name" : "Bosh", "age" : 31, "team" : "mia", "points" : 17000 }
>
```

类似于SQL :

```sql
Select * from col where age > 30 AND likes < 35;
```

> 注意的是 `$gt`条件要写在`$lt`条件之前。

## MongoDB `$type` 操作符

### 描述

`$type`操作符是基于BSON类型来检索集合中匹配的数据类型，并返回结果。

MongoDB 中可以使用的类型如下表所示 :

| **类型**                  | **数字** | **备注**         |
| ----------------------- | ------ | -------------- |
| Double                  | 1      |                |
| String                  | 2      |                |
| Object                  | 3      |                |
| Array                   | 4      |                |
| Binary data             | 5      |                |
| Undefined               | 6      | 已废弃。           |
| Object id               | 7      |                |
| Boolean                 | 8      |                |
| Date                    | 9      |                |
| Null                    | 10     |                |
| Regular Expression      | 11     |                |
| JavaScript              | 13     |                |
| Symbol                  | 14     |                |
| JavaScript (with scope) | 15     |                |
| 32-bit integer          | 16     |                |
| Timestamp               | 17     |                |
| 64-bit integer          | 18     |                |
| Min key                 | 255    | Query with -1. |
| Max key                 | 127    |                |

### 实例

在原来的`players`里面增加一条数据 :

```shell
> db.players.insert({name: 'Coach', age: 57, team: 1024, points: "" })
WriteResult({ "nInserted" : 1 })
> db.players.find()
{ "_id" : ObjectId("570f4ae4834e0c95484e80ac"), "name" : "James", "age" : 30, "team" : "cav", "points" : 25000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ad"), "name" : "Curry", "age" : 27, "team" : "saw", "points" : 15000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ae"), "name" : "Wade", "age" : 33, "team" : "mia", "points" : 20000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80af"), "name" : "Bosh", "age" : 31, "team" : "mia", "points" : 17000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80b0"), "name" : "Kobe", "age" : 37, "team" : "lal", "points" : 35000 }
{ "_id" : ObjectId("570f519f834e0c95484e80b1"), "name" : "Coach", "age" : 57, "team" : 1024, "points" : "" }
>

```

然后查询出`players`集合中`team`为`String`的数据 :

```shell
> db.players.find( {"team": {$type : 2} })
{ "_id" : ObjectId("570f4ae4834e0c95484e80ac"), "name" : "James", "age" : 30, "team" : "cav", "points" : 25000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ad"), "name" : "Curry", "age" : 27, "team" : "saw", "points" : 15000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80ae"), "name" : "Wade", "age" : 33, "team" : "mia", "points" : 20000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80af"), "name" : "Bosh", "age" : 31, "team" : "mia", "points" : 17000 }
{ "_id" : ObjectId("570f4ae4834e0c95484e80b0"), "name" : "Kobe", "age" : 37, "team" : "lal", "points" : 35000 }
```

查询`players`集合中`team`为数字的 :

```shell
> db.players.find( {"team": {$type : 1} })
{ "_id" : ObjectId("570f519f834e0c95484e80b1"), "name" : "Coach", "age" : 57, "team" : 1024, "points" : "" }
```
